In [27]:
import numpy as np
import pandas as pd

# Pandas

### make dataframe with index

In [3]:
df_withindex = pd.DataFrame([[1,2,3], [4,5,6]], index=["a","b"])

In [4]:
df_withindex

   0  1  2
a  1  2  3
b  4  5  6

### change df column ans index

In [5]:
df =  pd.DataFrame([[1,2,3], [4,5,6]])

In [6]:
df

   0  1  2
0  1  2  3
1  4  5  6

In [9]:
df.rename(columns={1:"name1", 2:"name2"})
# need inplace=True for adapting

   0  name1  name2
0  1      2      3
1  4      5      6

In [10]:
df.rename(columns={0:"row1", 1:"row1"})

   row1  row1  2
0     1     2  3
1     4     5  6

### change index

In [11]:
df =  pd.DataFrame([[1,2,3], [4,5,6]], columns=["target", 0, 1])

In [12]:
df

   target  0  1
0       1  2  3
1       4  5  6

In [13]:
df.set_index("target")

        0  1
target
1       2  3
4       5  6

### drop row or column

In [14]:
df =  pd.DataFrame([[1,2,3], [4,5,6]])

In [15]:
df

   0  1  2
0  1  2  3
1  4  5  6

In [16]:
df.drop(0)

   0  1  2
1  4  5  6

In [17]:
df.drop(0, axis=1)

   1  2
0  2  3
1  5  6

### sort index, value

In [19]:
df =  pd.DataFrame([[1,2,3], [4,5,6]], index=[2,1])

In [20]:
df

   0  1  2
2  1  2  3
1  4  5  6

In [21]:
df.sort_index(ascending=True)

   0  1  2
1  4  5  6
2  1  2  3

In [25]:
df.sort_values(1, ascending=False)
# chage index with values too

   0  1  2
1  4  5  6
2  1  2  3

### Get Z-score

In [26]:
df

   0  1  2
2  1  2  3
1  4  5  6

In [31]:
mean_0 = np.mean(df[0])
std_0 = np.std(df[0])

df["z_0"] = (df[0] - mean_0) / std_0

In [32]:
df

   0  1  2  z_0
2  1  2  3 -1.0
1  4  5  6  1.0

### Handing NaN values

In [42]:
df = pd.DataFrame({0:range(8), 1:range(8)})
x = [1,2,3,4,None,None,5,6]
df["x"] = x

In [43]:
df

   0  1    x
0  0  0  1.0
1  1  1  2.0
2  2  2  3.0
3  3  3  4.0
4  4  4  NaN
5  5  5  NaN
6  6  6  5.0
7  7  7  6.0

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       8 non-null      int64
 1   1       8 non-null      int64
 2   x       6 non-null      float64
dtypes: float64(1), int64(2)
memory usage: 320.0 bytes

In [45]:
df.isnull()

       0      1      x
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False   True
5  False  False   True
6  False  False  False
7  False  False  False

In [48]:
df.dropna(axis=0)

   0  1    x
0  0  0  1.0
1  1  1  2.0
2  2  2  3.0
3  3  3  4.0
6  6  6  5.0
7  7  7  6.0

In [51]:
d_mean = df["x"].mean()
df["x"].fillna(d_mean, inplace=True)
df

   0  1    x
0  0  0  1.0
1  1  1  2.0
2  2  2  3.0
3  3  3  4.0
4  4  4  3.5
5  5  5  3.5
6  6  6  5.0
7  7  7  6.0

### 이상치처리(사분위수)

In [52]:
df =  pd.DataFrame([[1,2,3], [4,5,6]])

In [55]:
df_1QR = df[0].quantile(0.25)
df_3QR = df[0].quantile(0.75)

df_IQR = df_3QR - df_1QR

print(df_1QR)
print(df_3QR)
print(df_IQR)

1.75
3.25
1.5